index=main sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1
| where match(ParentImage,"(?i)powershell\.exe$") AND match(Image,"(?i)cmd\.exe$")
  AND match(CommandLine,"(?i)/c.*whoami")
| eval attack_technique="T1059.001" | eval rule_id="SC-008"
| table _time, ComputerName, User, ParentImage, Image, CommandLine
